src/index-ds.org
#+title: 分布式系统 Distributed System

- http://book.mixu.net/distsys/single-page.html
- [[file:design-data-intensive-applications.org][Design Data-Intensive Applications]]
- [[http://dancres.org/reading_list.html][A Distributed Systems Reading List]]
- [[http://duanple.blog.163.com/blog/static/709717672011330101333271/][分布式系统领域经典论文翻译集]]

** Projects
- [[file:akka.org][Akka]] Akka文档阅读笔记
- [[file:storm.org][Storm]] Twitter的流式处理系统
- [[file:samza.org][Samza]] LinkedIn的流式处理系统
- [[file:hadoop.org][Hadoop]] Apache的分布式系统基础架构总称
  - [[file:hadoop-overview.org][Hadoop Overview]] @ 2012
  - [[file:hadoop-benchmark.org][Hadoop Benchmark]]
  - [[file:hadoop-definitive-guide.org][Hadoop权威指南(笔记)]]
- [[file:hdfs.org][HDFS]] Apache Hadoop项目的 [[file:gfs.org][GFS]] 开源实现
- [[file:hbase.org][HBase]] Apache Hadoop项目的 [[file:bigtable.org][BigTable]] 开源实现
  - [[file:hbase-definitive-guide.org][HBase权威指南(笔记)]]
  - [[file:hbase-configuration.org][Apache HBase Configuration]]
- [[file:mapred.org][MapReduce]] Apache Hadoop项目的 [[file:mapreduce.org][MapReduce]] 开源实现
- [[file:azkaban.org][Azkaban]] Linkedin的工作流系统，比 [[file:oozie.org][Oozie]] 好用太多.
- [[file:opentsdb.org][OpenTSDB]] 在 [[file:hbase.org][HBase]] 上构建的时间序列(time series)数据库
- [[file:impala.org][Impala]] Cloudera的 [[file:dremel.org][Dremel]] 开源实现
- [[file:presto.org][Presto]] Facebook的 [[file:dremel.org][Dremel]] 开源实现
- [[file:spark.org][Spark]] AMPLab的分布式计算系统
- [[file:paxos.org][Paxos]] / [[file:raft.org][Raft]] 分布式一致性算法

