html/index-ds.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- Global site tag (gtag.js) - Google Analytics --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>分布式系统 Distributed System</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="work" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">分布式系统 Distributed System</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3ef579f">1. Projects</a></li>
<li><a href="#orgde794df">2. Articles</a></li>
<li><a href="#org2f1e977">3. Papers</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href="http://book.mixu.net/distsys/single-page.html">http://book.mixu.net/distsys/single-page.html</a></li>
<li><a href="design-data-intensive-applications.html">Design Data-Intensive Applications</a></li>
<li><a href="http://dancres.org/reading_list.html">A Distributed Systems Reading List</a></li>
<li><a href="http://duanple.blog.163.com/blog/static/709717672011330101333271/">分布式系统领域经典论文翻译集</a></li>
</ul>

<div id="outline-container-org3ef579f" class="outline-2">
<h2 id="org3ef579f"><span class="section-number-2">1</span> Projects</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="akka.html">Akka</a> Akka文档阅读笔记</li>
<li><a href="storm.html">Storm</a> Twitter的流式处理系统</li>
<li><a href="samza.html">Samza</a> LinkedIn的流式处理系统</li>
<li><a href="hadoop.html">Hadoop</a> Apache的分布式系统基础架构总称
<ul class="org-ul">
<li><a href="hadoop-overview.html">Hadoop Overview</a> @ 2012</li>
<li><a href="hadoop-benchmark.html">Hadoop Benchmark</a></li>
<li><a href="hadoop-definitive-guide.html">Hadoop权威指南(笔记)</a></li>
</ul></li>
<li><a href="hdfs.html">HDFS</a> Apache Hadoop项目的 <a href="gfs.html">GFS</a> 开源实现</li>
<li><a href="hbase.html">HBase</a> Apache Hadoop项目的 <a href="bigtable.html">BigTable</a> 开源实现
<ul class="org-ul">
<li><a href="hbase-definitive-guide.html">HBase权威指南(笔记)</a></li>
<li><a href="hbase-configuration.html">Apache HBase Configuration</a></li>
</ul></li>
<li><a href="mapred.html">MapReduce</a> Apache Hadoop项目的 <a href="mapreduce.html">MapReduce</a> 开源实现</li>
<li><a href="azkaban.html">Azkaban</a> Linkedin的工作流系统，比 <a href="oozie.html">Oozie</a> 好用太多.</li>
<li><a href="opentsdb.html">OpenTSDB</a> 在 <a href="hbase.html">HBase</a> 上构建的时间序列(time series)数据库</li>
<li><a href="impala.html">Impala</a> Cloudera的 <a href="dremel.html">Dremel</a> 开源实现</li>
<li><a href="presto.html">Presto</a> Facebook的 <a href="dremel.html">Dremel</a> 开源实现</li>
<li><a href="spark.html">Spark</a> AMPLab的分布式计算系统</li>
<li><a href="paxos.html">Paxos</a> / <a href="raft.html">Raft</a> 分布式一致性算法</li>
</ul>
</div>
</div>
