html/index-ds.html

<div id="outline-container-orgde794df" class="outline-2">
<h2 id="orgde794df"><span class="section-number-2">2</span> Articles</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>201810 <a href="fallacies-of-distributed-computing-explained.html">Fallacies of Distributed Computing Explained</a></li>
<li>201808 <a href="youtube-scalability.html">YouTube Scalability</a> on youtube</li>
<li>201712 <a href="timeline-at-scale-in-twitter.html">Timeline at Scale in Twitter</a> by Raffi Krikorian @ 2013</li>
<li>201711 <a href="getting-real-about-distributed-system-reliability.html">Getting Real About Distributed System Reliability</a> Jay Kreps （分布式系统的真实的可靠性）</li>
<li>201606 <a href="anaconda-high-perf-solution.html">Anacoda High Performance Solution</a></li>
<li>201604 <a href="data-infra-at-airbnb.html">Data Infrastructure at Airbnb</a></li>
<li><a href="distributed-system-reading.html">Distributed System Reading</a></li>
<li><a href="you-can-not-sacrifice-partition-tolerance.html">You Can't Sacrifice Partition Tolerance</a></li>
<li><a href="the-anatomy-of-the-google-architecture.html">The Anatomy Of The Google Architecture</a> @2009 Google架构的深入解析，属于非官方文档，是一个非Google的友人收集各种资料汇集起来的</li>
<li><a href="building-scalable-highly-concurrent-and-fault-tolerant-systems.html">Building Scalable, Highly Concurrent &amp; Fault-Tolerant Systems: Lessons Learned</a></li>
<li><a href="data-structures-and-algorithms-for-big-databases.html">Data Structures and Algorithms for Big Databases</a></li>
<li><a href="building-software-systems-at-google-and-lessons-learned.html">Building Software Systems at Google and Lessons Learned</a> @Stanford-2010 Jeff Dean</li>
<li><a href="web-search-for-a-planet.html">Web Search for a Planet</a> @2003 Google Web Search</li>
<li><a href="case-study-gfs-evolution-on-fast-forward.html">Case Study GFS: Evolution on Fast-forward</a> @2009 GFS1</li>
<li><a href="how-to-beat-the-cap-theorem.html">How to beat the CAP theorem</a></li>
<li><a href="google-cluster-computing-faculty-traning-workshop.html">Google Cluster Computing Faculty Training Workshop</a></li>
<li><a href="mapreduce-a-major-step-backwards.html">MapReduce: A major step backwards</a> PDBMS阵营对MR阵营的批评</li>
<li><a href="mapreduce-a-major-step-backwards-ii.html">MapReduce: A major step backwards-ii</a> PDBMS阵营对MR阵营的第二轮批评</li>
<li><a href="a-comparison-of-approaches-to-large-scale-data-analysis.html">A Comparison of Approaches to Large-Scale Data Analysis</a></li>
<li><a href="mapreduce-a-flexible-data-processing-tool.html">MapReduce: A Flexible Data Processing Tool</a> MR阵营对PDBMS阵营的回应</li>
<li><a href="mapreduce-and-parellel-dbms-friends-or-foes.html">MapReduce and Parallel DBMSs: Friends or Foes?</a> PDBMS阵营和MR阵营达成和解</li>
<li><a href="mapreduce-versus-parellel-dbms.html">MapReduce Versus Parallel DBMS</a></li>
<li><a href="distributed-algorithms-in-nosql-databases.html">Distributed Algorithms in NoSQL Databases</a></li>
<li><a href="mapreduce-a-minor-step-forward.html">MapReduce: A Minor Step Forward</a> James Hamilton对PDBMS和MR的看法</li>
<li><a href="large-scale-data-and-computation-chanllenges-and-opportunities.html">Large-Scale Data and Computation: Challenges and Opportunities</a> @Stanford-2013 Jeff Dean</li>
<li><a href="designs-lessons-and-advice-from-building-large-distributed-systems.html">Designs, Lessons and Advice from Building Large Distributed Systems</a> @LADIS-2009 Jeff Dean</li>
<li><a href="tail-at-scale.html">The Tail at Scale</a> @2013 CACM Jeff Dean</li>
<li><a href="realtime-big-data-analytics-emerging-architecture.html">Real-Time Big Data Analytics: Emerging Architecture</a></li>
<li><a href="unveil-google-app-engine.html">探索Google App Engine背后的奥秘</a></li>
<li><a href="beating-the-cap-theorem-checklist.html">Beating the CAP Theorem Checklist</a> "遇到声称能突破CAP原理的民科的时候，用这个checklist来对付他" via @delphij</li>
<li><a href="in-stream-big-data-processing.html">In-Stream Big Data Processing</a> 流式处理系统一些需要解决的问题以及方法</li>
<li><a href="lessons-learned-while-building-infrastructure-software-at-google.html">Lessons Learned While Building Infrastructure Software at Google</a> @XLDB-2013 Jeff Dean</li>
<li><a href="a-word-on-scalability.html">A Word on Scalability</a></li>
<li><a href="application-resilience-in-a-service-oriented-architecture.html">Application Resilience in a Service-oriented Architecture</a></li>
<li><a href="building-data-science-teams.html">Building Data Science Teams</a></li>
<li><a href="on-designing-and-deploying-internet-scale-services.html">On Designing and Deploying Internet-Scale Services</a> @2007</li>
<li><a href="analysis-of-hdfs-under-hbase-a-facebook-messages-case-study.html">Analysis of HDFS Under HBase: A Facebook Messages Case Study</a> @2014</li>
<li><a href="the-log-what-every-software-engineer-should-know-about-real-time-datas-unifying-abstraction.html">The Log: What every software engineer should know about real-time data's unifying abstraction</a></li>
<li><a href="hadoop-at-a-crossroads.html">Hadoop at a Crossroads?</a> by Michael Stonebraker</li>
<li><a href="a-typical-data-processing-system.html">A Typical Data Processing System</a> by me:) 一个典型的数据处理系统</li>
<li><a href="what-does-big-data-mean.html">What Does 'Big Data' Mean?</a> by Michael Stonebraker</li>
<li><a href="possible-hadoop-trajectories.html">Possible Hadoop Trajectories</a> by Michael Stonebraker</li>
<li><a href="notes-on-distributed-systems-for-young-bloods.html">Notes on Distributed Systems for Young Bloods</a> 写给分布式系统新手的笔记</li>
<li><a href="bringing-spark-closer-to-bare-metal.html">Project Tungsten: Bringing Spark Closer to Bare Metal</a> 优化Spark性能的一篇文章</li>
<li><a href="lessons-learned-while-working-on-large-scale-server-softwarre.html">Lessons Learned while Working on Large-Scale Server Software</a></li>
<li><a href="questioning-the-lambda-architecture.html">Questioning the Lambda Architecture</a> @2014</li>
<li><a href="service-disoriented-architecture.html">Service-Disoriented Architecture</a> 对SOA(和microservices)的反思</li>
<li><a href="building-a-production-machine-learning-infrastructure.html">Building a Production Machine Learning Infrastructure</a> 构建用于生产的ML基础架构（如何平衡算法和工程）</li>
<li><a href="scaling-lessons-learned-at-dropbox.html">Scaling lessons learned at Dropbox</a></li>
<li><a href="microservices-not-a-free-lunch.html">Microservices - Not A Free Lunch!</a></li>
<li><a href="what-it-takes-to-run-stack-overflow.html">What it takes to run Stack Overflow</a> @2013.11</li>
<li><a href="mesos-omega-borg-a-survey.html">mesos, omega, borg: a survey</a> @2015</li>
<li><a href="what-does-it-take-to-make-google-work-at-scale.html">What does it take to make Google work at scale?</a> @2015</li>
<li><a href="building-a-terabyte-scale-data-cycle-at-linkedin-with-hadoop-and-project-voldemort.html">Building a terabyte-scale data cycle at LinkedIn with Hadoop and Project Voldemort</a> @ 2009</li>
<li><a href="project-voldemort-scaling-simple-storage-at-linkedin.html">Project Voldemort: Scaling Simple Storage at LinkedIn</a> @ 2009</li>
<li><a href="druid-design-doc.html">Druid Design Doc</a> Metamarket的大规模数据上的实时OLAP</li>
<li><a href="intro-druid-real-time-analytics-at-a-billion-rows-per-second.html">Introducing Druid: Real-Time Analytics at a Billion Rows Per Second</a> @2011</li>
<li><a href="druid-part-deux-three-principles-for-fast-dist-olap.html">Druid, Part Deux: Three Principles for Fast, Distributed OLAP</a> @2011</li>
<li><a href="corona.html">Under the Hood: Scheduling MapReduce jobs more efficiently with Corona</a> @ 2012</li>
<li><a href="yarn-intro.html">Introducing Apache Hadoop YARN</a> @ 2012</li>
<li><a href="manhattan.html">Manhattan, our real-time, multi-tenant distributed database for Twitter scale</a> @ 2014</li>
<li><a href="best-practices-for-selecting-apache-hadoop-hardware.html">Best Practices for Selecting Apache Hadoop Hardware</a> @2011</li>
<li><a href="the-dark-side-of-hadoop.html">The dark side of Hadoop - BackType Technology</a> @2011</li>
<li><a href="apache-hadoop-goes-realtime-at-facebook.html">Apache Hadoop Goes Realtime at Facebook</a> @2011</li>
<li><a href="is-hadoop-out-of-date.html">Hadoop即将过时了吗？</a> @2012</li>
<li><a href="hdfs-reliability-with-namenode-and-avatarnode.html">Hadoop Distributed Filesystem reliability with Namenode and Avatarnode</a> @2012</li>
<li><a href="ha-namenode-for-hdfs-with-hadoop1.html">HA Namenode for HDFS with Hadoop 1.0</a> @2012</li>
<li><a href="hadoop-io-files.html">Hadoop I/O: Sequence, Map, Set, Array, BloomMap Files</a> @2011</li>
<li><a href="why-not-raid0-in-hdfs.html">Why not RAID-0? It's about Time and Snowflakes</a> @2012</li>
<li><a href="hbase-write-path.html">HBase Write Path</a> @ 2012</li>
<li><a href="hbase-log-splitting.html">HBase Log Splitting</a> @2012</li>
<li><a href="alibaba-hbase-practice.html">阿里HBase业务设计实践</a> @ 2012</li>
<li><a href="using-hbase-with-iomemory.html">Using HBase with ioMemory</a> by fusion-io</li>
<li><a href="7-tips-for-improving-mapreduce-performance.html">7 Tips for Improving MapReduce Performance</a> @2009</li>
<li><a href="mapreduce-patterns-algos-and-use-cases.html">MapReduce Patterns, Algorithms, and Use Cases</a> @2012</li>
<li><a href="cloudera-impala-real-time-queries-in-apache-hadoop-for-real.html">Cloudera Impala: Real-Time Queries in Apache Hadoop, For Real</a> @2012</li>
<li><a href="streambase.html">A Glance on StreamBase</a> 之前调研过的商用流式处理系统</li>
<li><a href="thoughts-on-systems-for-large-datasets.html">Thoughts on Systems for Large Datasets: Problems and Opportunities</a> @ 2014 Jeff Dean</li>
<li><a href="why-google-stores-billions-of-lines-of-code-in-a-single-repository.html">Why Google Stores Billions of Lines of Code in a Single Repository</a> @ 2016</li>
<li><a href="achieving-rapid-response-times-in-large-online-services.html">Achieving Rapid Response Times in Large Online Services</a> @ 2012 Jeff Dean</li>
<li><a href="large-scale-deep-learning-for-intelligent-computer-systems.html">Large-Scale Deep Learning for Intelligent Computer Systems</a> @ 2016 Jeff Dean</li>
</ul>
</div>
</div>
